SOAP/Пример/Решение.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wrap="http://foo.bar/wrappersoapserver">
   <soapenv:Header/>
   <soapenv:Body>
      <wrap:MagicSearch>
         <query>Иванов</query>
         <partyType>USER</partyType>
         <taskStatus>ACTUAL</taskStatus>
      </wrap:MagicSearch>
   </soapenv:Body>
</soapenv:Envelope>